---
type: RebarShapeConstraint180DegreeBendArcLength
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 1
tags: [revit-api, class]
---

# RebarShapeConstraint180DegreeBendArcLength

`Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendArcLength` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RebarShapeConstraint180DegreeBendArcLength | 2012 | `public RebarShapeConstraint180DegreeBendArcLength ( ElementId paramId )` |